import React, {useState} from 'react';
import {Typography} from 'antd';
import {textLineBreak} from 'libs/textLineBreak';

export const AgreementText = `제1장 총칙

제1조 (목적)
이 약관은 '파주여성민우회'(이하 "민우회"라 함)이 제공하는 인터넷 서비스(이하 "서비스"라 함)의 이용 조건 및 절차, 이용자와 민우회의 권리·의무 및 책임사항을 규정함을 목적으로 합니다.
 
제2조 (용어의 정의)
① 이 약관에서 사용하는 용어의 정의는 다음과 같습니다.
 
1. 회원 : 민우회의 목적에 뜻을 같이 하며 회원가입을 신청한 개인
1. 이용자 : 민우회의 활동소식의 공유 등의 서비스를 위해 서비스 이용 요청을 한 개인
2. 이용자ID : 이용자 식별과 서비스 이용을 위하여 이용자가 선정하고 민우회가 승인한 문자로 숫자 조합으로 이용자 한 사람당 하나의 고유한 ID를 발급함.
3. 비밀번호 : 이용자ID와 일치된 회원의 개인정보 보호를 위하여 회원이 설정한 문자와 숫자의 조합.
4. 서비스 안내 : 민우회가 이용자의 이용조건 및 절차, 요금, 민우회의 관리방침 등 이용자의 서비스에 필요한 모든 사항을 이용자에게 공지하는 영역.
 
② 이 약관에서 사용하는 용어의 정의는 전항에서 정하는 것을 제외하고는 일반 사전 정의에 따릅니다.
 
제3조 (약관의 효력 및 변경)
① 이 약관은 민우회의 웹사이트(http://www.womenlink.or.kr)에 게시하거나, 기타의 방법으로 이용자에게 공지함으로써 효력을 발생합니다.
② 민우회는 합리적인 사유가 발생하는 경우에는, 약관의 규제등에관한법률, 정보통신망 이용촉진등에관한 법률 등 관련법을 위배하지 않는 범위에서 본 약관을 개정할 수 있습니다.
③ 본 약관을 개정할 경우에는 현행약관과 함께 초기화면에 그 적용일자 7일 이전부터 적용일자 전일까지 공지하며, 적용일로부터 효력이 발생합니다.
④ 변경된 약관 사항에 동의하지 않는 이용자는 언제든지 서비스 이용을 중단하고 이용계약을 해지할 수 있습니다. 변경된 약관의 효력발생일로부터 7일 이내에 거부의사를 표시할 수 있으며, 기간 내에 거부의사를 표시하지 않는 경우에는 동의한 것으로 간주합니다.
⑤ 이 약관에 명시되지 아니한 사항에 대하여는 관계법령 및 민우회의 공지, 서비스 안내에서 정한 바에 따릅니다.
 
 
제2장 이용계약의 체결
 
제4조 (이용신청)
① 이용계약은 서비스의 이용을 원하는 자가 민우회가 정한 약관에 "동의"함을 표시하고, 온라인 신청양식을 작성하여 서비스 이용을 신청한 후, 민우회가 이를 승낙함으로써 성립합니다.
② 서비스의 이용을 원하는 자가 약관에 "동의"를 표시하고 서비스 이용을 신청하는 것은 약관의 내용을 숙지하고 준수할 것에 동의하는 것으로 간주됩니다.
 
제5조 (이용신청에 대한 불승낙과 승낙의 보류)
① 민우회는 제 4조의 규정에 의한 이용신청에 대하여 업무수행 상 또는 기술상 지장이 없는 경우에는 원칙적으로 접수 순서에 따라 이용신청을 승낙합니다.
② 민우회는 다음 각 호의 1에 해당하는 이용신청에 대하여는 승낙을 하지 아니할 수 있습니다.
1. 다른 사함의 이름과 정보를 사용하여 신청하였을 때
2. 허위의 신청이거나 허위서류를 첨부한 경우
3. 기타 이용신청고객의 귀책사유로 이용승낙이 곤란한 경우
③ 민우회는 다음 각 호의 1에 해당하는 이용신청에 대하여는 그 사유가 해소될 때까지는 승낙을 보류할 수 있습니다.
1. 설비의 여유가 없는 경우
2. 민우회의 업무상 또는 기술상 지장이 있는 경우
 
 
제3장 서비스 이용
 
제6조 (서비스 내용)
① 민우회는 이용자에게 아래와 같은 서비스를 제공합니다.
1. 회원커뮤니티 서비스
2. 기타 민우회가 이용자를 위해 제공하는 서비스
 
② 민우회가 제공하는 서비스의 내용은 변경되거나 추가될 수 있습니다. 서비스의 내용이 추가되거나 변경됨으로써 이용에 필요한 사항이 변경될 경우 서비스 안내 혹은 별도의 공지를 통해 이용자에게 변경 내용이 통지됩니다.
 
제7조 (서비스 이용에 따른 이용자ID의 관리)
① 이용자ID 및 비밀번호의 관리 및 이용은 이용자의 책임으로 합니다.
② 민우회는 이용자ID에 의하여 게시판 관리 등 제반 이용자 관리업무를 수행하며, 민우회가 인정할 수 있는 명백한 사유가 없는 한 이용자는 이용자ID를 타인에게 양도할 수 없습니다.
 
제8조 (서비스 이용의 제한 및 이용계약의 해지)
① 이용자가 서비스 이용계약을 해지하고자 하는 때에는 이용자 본인이 직접 민우회에 메일이나 전화 등을 통해 해지신청을 하여야 합니다.
② 민우회는 이용자가 다음 각 호의 1에 해당하는 경우 이용계약을 해지하거나 또는 1개월 이내의 기간을 정하여 서비스 이용을 정지시킬 수 있습니다.
1. 본 약관에 규정된 이용자의 의무를 이행하지 않은 경우
2. 민우회의 서비스 운영을 고의로 방해한 경우
3. 수신자의 의사에 반하는 광고성 정보를 지속적으로 전송하는 경우.
4. 정보통신설비의 오작동이나 정보 등의 파괴를 유발하는 컴퓨터 바이러스 프로그램 등을 유포하는 경우
5. 다른 이용자들에게 고의로 피해를 주거나, 공익을 저해했을 경우
 
제9조 (이용제한 및 해지 절차)
① 민우회는 전조의 제2항의 규정에 의하여 이용계약의 해지 또는 이용 정지 등 이용제한을 하고자 하는 경우에는 그 사유를 이용제한 5일 전까지 서면 또는 전화, 전자우편 등의 방법으로 해당 이용자 또는 대리인에게 통지합니다. 단, 긴급하게 이용을 제한할 필요가 있는 경우에는 그러하지 않습니다.
② 전항의 규정에 의하여 이용제한 조치의 통지를 받은 이용자 또는 그 대리인은 그 이용제한 조치에 대하여 불복할 경우에는 이의신청을 할 수 있습니다.
③ 민우회는 전항의 규정에 의한 이의신청에 대하여 그 확인을 위한 기간까지 이용제한 조치를 일시 연기할 수 있으며, 그 결과를 이용자 또는 그 대리인에게 통지합니다.
④ 민우회는 이용정지 기간 중에 그 이용정지의 사유가 해소된 것이 확인된 경우에는 이용정지 조치를 해제할 수 있습니다.
 
제10조 (휴면계정의 관리)
① 이용자가 서비스를 이용하는 도중, 3개월 동안 서비스를 이용하기 위해 로그인(log-in)한 기록이 없는 경우, 민우회는 이용자의 서비스에 제한을 가할 수 있습니다.
 
② 이용자가 서비스를 이용하는 도중, 연속하여 1년 동안 서비스를 이용하기 위해 로그인(log-in)한 기록이 없는 경우, 민우회는 이용자와의 이용계약을 해지할 수 있습니다.
 
제11조 (자료의 저장)
민우회는 이용자가 제공하는 정보, 자료에 대하여 민우회의 공지 또는 서비스 안내에서 정한 바에 따라 일정한 게재기한 및 용량을 정할 수 있습니다.
 
제12조 (서비스 중지)
① 민우회는 시스템 점검, 증설 및 교체 등의 사유로 인하여 서비스를 중지할 수 있습니다. 이 경우 그 사유 및 기간 등을 회원에게 사전에 공지합니다.
② 민우회는 서비스 설비의 장애 또는 서비스 이용의 폭주 등 정상적인 서비스 제공이 불가능할 경우에는 서비스의 전부 또는 일부를 제한하거나 중지할 수 있습니다. 이 경우 그 사유 및 기간 등을 회원에게 사전 또는 사후에 공지합니다.
③ 민우회는 전시, 사변, 천재지변 또는 이에 준하는 국가비상사태가 발생하거나 발생할 우려가 있는 경우와 전기통신사업법에 의한 기간통신 사업자가 전기통신서비스를 중지하는 등 부득이한 사유가 있는 경우에는 서비스의 전부 또는 일부를 제한하거나 정지할 수 있습니다. 이 경우 그 사유 및 기간 등을 회원에게 사전 또는 사후에 공지합니다.
 
 
제4장 민우회와 이용자의 의무
 
제13조 (민우회의 의무)
① 민우회는 본 약관이 정하는 바에 따라 지속적이고, 안정적으로 서비스를 제공하기 위해서 노력합니다.
② 민우회는 이용자로부터 제기되는 의견이나 불만이 정당하다고 인정할 경우에는 즉시 처리하여야 합니다. 단, 즉시 처리가 곤란한 경우에는 이용자에게 그 사유와 처리 일정을 서면이나 전자우편 또는 전화 등의 방법으로 통보하여야 합니다.
③ 민우회는 서비스 제공 설비를 항상 운용 가능한 상태로 유지 보수하여야 합니다. 다만, 천재지변, 비상사태 또는 그밖에 부득이한 경우에는 그 서비스를 일시 중단하거나 중지할 수 있습니다.
 
제14조 (이용자의 의무)
① 이용자는 이 약관에서 규정하는 사항과 민우회가 정한 제반 정책 및 서비스 안내 등을 준수하여야 합니다.
② 이용자는 서비스를 이용할 때 다음 각 호를 지켜야 합니다.
1. 다른 이용자의 이용자ID 및 비밀번호를 부정하게 사용하지 아니합니다.
2. 표현의 자유, 프라이버시권, 온라인 공동체의 자치권 등 다른 이용자의 권리를 존중합니다.
3. 온라인 성폭력, 차별적 발언 등 소수자의 권리를 침해하는 행위를 해서는 안 됩니다.
4. 민우회의 업무수행 혹은 서비스 운영을 방해하거나 저해하는 행위를 해서는 안 됩니다.
5. 기타 관계법령에서 명백한 범죄행위로 규정하고 있는 행위는 하지 않습니다.
③ 이용자는 서비스 내용별로 민우회가 서비스 안내에 게시하거나 별도로 공지한 이용제한 사항을 준수하여야 합니다.
④ 이용자는 민우회에서 허용한 경우를 제외하고는 서비스를 이용하여 영업활동을 할 수 없습니다. 이를 어기고 발생한 영업활동의 결과 및 손실에 관해서 민우회는 책임을 지지 않습니다.
 
 
제5장 서비스 운영 정책
 
제15조 (이용자의 개인정보보호)
① 이용자의 개인정보 보호는 관계법령과 민우회의 개인정보보호정책에 따릅니다.
② 이용자가 자신의 개인정보를 전송 등의 방법으로 민우회에 제공하는 행위는 민우회의 개인정보 수집 및 이용에 동의하는 것으로 간주합니다.
 
제16조 (게시물의 삭제 등의 조치)
① 민우회는 이용자가 게시하거나 등록하는 서비스 내의 게시물을 임의로 삭제할 수 없습니다. 단, 다음 각 호의 1에 해당하는 게시물을 삭제, 이동, 등록거부 등 필요한 조치를 취할 수 있습니다.
1. 타인의 권리를 침해하는 행위와 관련되거나, 그 행위를 구성하는 게시물로서 이해당사자의 삭제 등 요청이 있거나 민우회가 고소, 고발될 수 있는 근거를 제공하는 게시물.
2. 서비스에 위해를 가할 소지가 있는 바이러스 등이 포함된 게시물.
3. 게재기한을 초과한 게시물.
4. 다른 이용자의 서비스 이용에 현저한 지장을 초래하는 게시물.
5. 관련 법령에 따라 불법임이 확정된 게시물.
② 민우회는 전항에 따른 조치를 취하는 경우에는 그 사실을 이용자에게 통지하여야 합니다. 단, 긴급을 요하는 경우에는 필요한 조치를 먼저 취한 후에 이용자에게 통지할 수 있습니다.
 
제17조(재판관할)
민우회와 이용자 간에 발생한 서비스 이용에 관한 분쟁에 대하여는 대한민국 법을 적용하며, 본 분쟁으로 인한 소는 민사소송법상의 관할을 가지는 대한민국의 법원에 제기합니다.
 
[부 칙]
 
(시행일) 이 약관은 2020년 9월 1일부터 시행합니다. 
`;
const {Title, Paragraph, Text} = Typography;
const Agreement = () => {
  return (
    <div style={{marginTop: '30px'}}>
      <Title level={3}><Text>이용 약관</Text></Title><br/>
      {textLineBreak(AgreementText)}
    </div>
  );
}

export default Agreement;
